var weekPoetry = [
    {
        "title": "清平乐·别来春半",
        "author": "李煜",
        "content": "别来春半,\n触目柔肠断。\n砌下落梅如雪乱，\n拂了一身还满。\n雁来音信无凭，\n路遥归梦难成。\n离恨恰如春草，\n更行更远还生。"
    },
    {
        "title": "问刘十九",
        "author": "白居易",
        "content": "绿蚁新醅酒，\n红泥小火炉。\n晚来天欲雪，\n能饮一杯无？"
    },
    {
        "title": "江城子·十年生死两茫茫",
        "author": "苏轼",
        "content": "十年生死两茫茫，\n不思量，自难忘。\n千里孤坟，无处话凄凉。\n纵使相逢应不识，\n尘满面，鬓如霜。\n夜来幽梦忽还乡，\n小轩窗，正梳妆。\n相顾无言，惟有泪千行。\n料得年年肠断处，\n明月夜，短松冈。"
    },
    {
        "title": "逢雪宿芙蓉山主人",
        "author": "刘长卿",
        "content": "日暮苍山远，\n天寒白屋贫。\n柴门闻犬吠，\n风雪夜归人。"
    },
    {
        "title": "临江仙·金锁重门荒苑静",
        "author": "鹿虔扆",
        "content": "金锁重门荒苑静，\n绮窗愁对秋空。\n翠华一去寂无踪。\n玉楼歌吹，\n声断已随风。\n烟月不知人事改，\n夜阑还照深宫。\n藕花相向野塘中，\n暗伤亡国，\n清露泣香红。"
    },
    {
        "title": "元日",
        "author": "王安石",
        "content": "爆竹声中一岁除，\n春风送暖入屠苏。\n千门万户瞳瞳日，\n总把新桃换旧符。"
    },
    {
        "title": "除夜",
        "author": "白居易",
        "content": "薄晚支颐坐，\n中宵枕臂眠。\n一从身去国，\n再见日周天。\n老度江南岁，\n春抛渭北田。\n浔阳来早晚，\n明日是三年。"
    },
    {
        "title": "菩萨蛮·风柔日薄春犹早",
        "author": "李清照",
        "content": "风柔日薄春犹早，\n夹衫乍着心情好。\n睡起觉微寒，\n梅花鬓上残。\n故乡何处是，\n忘了除非醉。\n沉水卧时烧，\n香消酒未消。"
    },
    {
        "title": "青玉案·元夕",
        "author": "辛弃疾",
        "content": "东风夜放花千树，\n更吹落，星如雨。\n宝马雕车香满路，\n凤萧声动，玉壶光转，\n一夜鱼龙舞。\n蛾儿雪柳黄金缕，\n笑语盈盈暗香去。\n众里寻他千百度，\n蓦然回首，那人却在，\n灯火阑珊处。"
    },
    {
        "title": "浪淘沙令·帘外雨潺潺",
        "author": "李煜",
        "content": "帘外雨潺潺，\n春意阑珊，\n罗衾不耐五更寒。\n梦里不知身是客，\n一饷贪欢。\n独自莫凭阑，\n无限江山，\n别时容易见时难。\n流水落花春去也，\n天上人间。"
    },
    {
        "title": "钗头凤·红酥手",
        "author": "陆游",
        "content": "红酥手，黄縢酒，\n满城春色宫墙柳。\n东风恶，欢情薄。\n一怀愁绪，几年离索。\n错、错、错。\n春如旧，人空瘦，\n泪痕红浥鲛绡透。\n桃花落，闲池阁。\n山盟虽在，锦书难托。\n莫、莫、莫！"
    },
    {
        "title": "破阵子·燕子来时新社",
        "author": "晏殊",
        "content": "燕子来时新社，\n梨花落后清明。\n池上碧苔三四点，\n叶底黄鹂一两声，\n日长飞絮轻。\n巧笑东邻女伴，\n采桑径里逢迎。\n疑怪昨宵春梦好，\n元是今朝斗草赢，\n笑从双脸生。"
    },
    {
        "title": "虞美人·听雨",
        "author": "蒋捷",
        "content": "少年听雨歌楼上。\n红烛昏罗帐。\n壮年听雨客舟中。\n江阔云低、断雁叫西风。\n而今听雨僧庐下。\n鬓已星星也。\n悲欢离合总无情。\n一任阶前、点滴到天明。"
    },
    {
        "title": "清明",
        "author": "杜牧",
        "content": "清明时节雨纷纷，\n路上行人欲断魂。\n借问酒家何处有，\n牧童遥指杏花村。"
    },
    {
        "title": "蝶恋花·春景",
        "author": "苏轼",
        "content": "花褪残红青杏小。\n燕子飞时，\n绿水人家绕。\n枝上柳绵吹又少，\n天涯何处无芳草！\n墙里秋千墙外道。\n墙外行人，\n墙里佳人笑。\n笑渐不闻声渐悄，\n多情却被无情恼。"
    },
    {
        "title": "阳春曲·春景",
        "author": "胡祗遹",
        "content": "几枝红雪墙头杏，\n数点青山屋上屏。\n一春能得几晴明？\n三月景，宜醉不宜醒。\n残花酝酿蜂儿蜜，\n细雨调和燕子泥。\n绿窗春睡觉来迟。\n谁唤起？窗外晓莺啼。\n一帘红雨桃花谢，\n十里清阴柳影斜。\n洛阳花酒一时别。\n春去也，闲煞旧蜂蝶。"
    },
    {
        "title": "婆罗门引·春尽夜",
        "author": "夏完淳",
        "content": "晚鸦飞去，一枝花影送黄昏。\n春归不阻重门。\n辞却江南三月，\n何处梦堪温？\n更阶前新绿，空锁芳尘。\n随风摇曳云，\n不须兰棹朱轮。\n只有梧桐枝上，留得三分。\n多情皓魄，怕明宵、还照旧钗痕。\n登楼望、柳外销魂"
    },
    {
        "title": "望江南·三月暮",
        "author": "吴文英",
        "content": "三月暮，\n花落更情浓。\n人去秋千闲挂月，\n马停杨柳倦嘶风。\n堤畔画船空。\n恹恹醉，\n长日小帘栊。\n宿燕夜归银烛外，\n啼莺声在绿阴中。\n无处觅残红。"
    },
    {
        "title": "蝶恋花",
        "author": "欧阳修",
        "content": "庭院深深深几许，\n杨柳堆烟，帘幕无重数。\n玉勒雕鞍游冶处，\n楼高不见章台路。 \n雨横风狂三月暮，\n门掩黄昏，无计留春住。\n泪眼问花花不语，\n乱红飞过秋千去。"
    },
    {
        "title": "大林寺桃花",
        "author": "白居易",
        "content": "人间四月芳菲尽，\n山寺桃花始盛开。\n长恨春归无觅处，\n不知转入此中来。"
    },
    {
        "title": "客中初夏",
        "author": "司马光",
        "content": "四月清和雨乍晴，\n南山当户转分明。\n更无柳絮因风起，\n惟有葵花向日倾。"
    },
    {
        "title": "阮郎归•初夏 ",
        "author": "宋·苏轼",
        "content": "绿槐高柳咽新蝉，\n薰风初入弦。\n碧纱窗下水沉烟，\n棋声惊昼眠。\n微雨过，\n小荷翻，\n榴花开欲燃。\n玉盆纤手弄清泉，\n琼珠碎却圆。"
    },
    {
        "title": "青玉案•横塘路",
        "author": "宋·贺铸",
        "content": "凌波不过横塘路，\n但目送，芳尘去。\n锦瑟华年谁与度？\n月桥花院，\n琐窗朱户，\n只有春知处。\n碧云冉冉蘅皋暮，\n彩笔新题断肠句。\n试问闲愁都几许？\n一川烟草，\n满城风絮，\n梅子黄时雨。"
    },
    {
        "title": "约客",
        "author": "宋·赵师秀",
        "content": "黄梅时节家家雨，\n青草池塘处处蛙。\n有约不来过夜半，\n闲敲棋子落灯花。"
    },
    {
        "title": "南乡子•端午",
        "author": "宋·李之仪",
        "content": "小雨湿黄昏。\n重午佳辰独掩门。\n巢燕引雏浑去尽，\n销魂。\n空向梁间觅宿痕。\n客舍宛如村。\n好事无人载一樽。\n唯有莺声知此恨，\n殷勤。\n恰似当时枕上闻。"
    },
    {
        "title": "喜晴",
        "author": "宋·范成大",
        "content": "窗间梅熟落蒂，\n墙下笋成出林。\n连雨不知春去，\n一晴方觉夏深。"
    },
    {
        "title": "西江月·夜行黄沙道中",
        "author": "宋·辛弃疾",
        "content": "明月别枝惊鹊，\n清风半夜鸣蝉。\n稻花香里说丰年，\n听取蛙声一片。 \n七八个星天外，\n两三点雨山前。\n旧时茅店社林边，\n路转溪桥忽见。"
    },
    {
        "title": "声声慢·寻寻觅觅",
        "author": "宋·李清照",
        "content": "寻寻觅觅，冷冷清清，凄凄惨惨戚戚。\n乍暖还寒时候，最难将息。\n三杯两盏淡酒，怎敌他、晚来风急？\n雁过也，正伤心，却是旧时相识。\n满地黄花堆积。憔悴损，如今有谁堪摘？\n守着窗儿，独自怎生得黑？\n梧桐更兼细雨，到黄昏、点点滴滴。\n这次第，怎一个愁字了得！"
    },
    {
        "title": "更漏子·玉炉香",
        "author": "唐·温庭筠",
        "content": "玉炉香，红蜡泪，\n偏照画堂秋思。\n眉翠薄，鬓云残，\n夜长衾枕寒。\n梧桐树，三更雨，\n不道离情正苦。\n一叶叶，一声声，\n空阶滴到明。"
    },
    {
        "title": "苔",
        "author": "清·袁枚",
        "content": "白日不到处，青春恰自来。\n苔花如米小，亦学牡丹开。"
    },
    {
        "title": "如梦令·常记溪亭日暮",
        "author": "宋·李清照",
        "content": "常记溪亭日暮，\n沉醉不知归路，\n兴尽晚回舟，\n误入藕花深处。\n争渡，争渡，\n惊起一滩鸥鹭。"
    },
    {
        "title": "浣溪沙·一曲新词酒一杯",
        "author": "宋·晏殊",
        "content": "一曲新词酒一杯，\n去年天气旧亭台，\n夕阳西下几时回。\n无可奈何花落去，\n似曾相识燕归来。\n小园香径独徘徊。"
    },
    {
        "title": "虞美人·春花秋月何时了",
        "author": "北宋·李煜",
        "content": "春花秋月何时了？\n往事知多少。\n小楼昨夜又东风，\n故国不堪回首月明中。\n雕栏玉砌应犹在，\n只是朱颜改。\n问君能有几多愁？\n恰似一江春水向东流。"
    },
    {
        "title": "如梦令·谁伴明窗独坐",
        "author": "宋·李清照",
        "content": "谁伴明窗独坐，\n我共影儿俩个。\n灯尽欲眠时，影也把人抛躲。\n无那，无那，\n好个凄凉的我。"
    },
    {
        "title": "清平乐·村居",
        "author": "宋·辛弃疾",
        "content": "茅檐低小，\n溪上青青草。\n醉里吴音相媚好，\n白发谁家翁媪?\n大儿锄豆溪东，\n中儿正织鸡笼。\n最喜小儿亡赖，\n溪头卧剥莲蓬。"
    },
    {
        "title": "秋夕",
        "author": "唐·杜牧",
        "content": "红烛秋光冷画屏，\n轻罗小扇扑流萤。\n天阶夜色凉如水，\n坐看牵牛织女星。"
    },
    {
        "title": "茅屋为秋风所破歌",
        "author": "唐·杜甫",
        "content": "八月秋高风怒号，卷我屋上三重茅。\n茅飞渡江洒江郊，高者挂罥长林梢，\n下者飘转沉塘坳。\n南村群童欺我老无力，忍能对面为盗贼。\n公然抱茅入竹去，唇焦口燥呼不得，\n归来倚杖自叹息。\n俄顷风定云墨色，秋天漠漠向昏黑。\n布衾多年冷似铁，娇儿恶卧踏里裂。\n床头屋漏无干处，雨脚如麻未断绝。\n自经丧乱少睡眠，长夜沾湿何由彻！\n安得广厦千万间，大庇天下寒士俱欢颜，\n风雨不动安如山！\n呜呼，何时眼前突兀见此屋，\n吾庐独破受冻死亦足！"
    },
    {
        "title": "赠刘景文",
        "author": "宋·苏轼",
        "content": "荷尽已无擎雨盖，\n菊残犹有傲霜枝。\n一年好景君须记，\n最是橙黄橘绿时。"
    },
    {
        "title": "水调歌头",
        "author": "宋·苏轼",
        "content": "明月几时有？把酒问青天。\n不知天上宫阙，今夕是何年？\n我欲乘风归去，又恐琼楼玉宇，\n高处不胜寒！起舞弄清影，\n何似在人间？ \n转朱阁，低绮户，照无眠。\n不应有恨，何事长向别时圆？\n人有悲欢离合，月有阴晴圆缺，\n此事古难全。\n但愿人长久，千里共婵娟。"
    },
    {
        "title": "秋词",
        "author": "唐·刘禹锡",
        "content": "自古逢秋悲寂寥，\n我言秋日胜春朝。\n晴空一鹤排云上，\n便引诗情到碧霄。"
    },
    {
        "title": "宣州谢朓楼饯别校书叔云",
        "author": "唐·李白",
        "content": "弃我去者，\n昨日之日不可留。\n乱我心者，\n今日之日多烦忧。\n长风万里送秋雁，\n对此可以酣高楼。\n蓬莱文章建安骨，\n中间小谢又清发。\n俱怀逸兴壮思飞，\n欲上青天览明月。\n抽刀断水水更流，\n举杯消愁愁更愁。\n人生在世不称意，\n明朝散发弄扁舟。"
    },
    {
        "title": "九月九日忆山东兄弟",
        "author": "唐·王维",
        "content": "独在异乡为异客，\n每逢佳节倍思亲。\n遥知兄弟登高处，\n遍插茱萸少一人。"
    },
    {
        "title": "醉花阴·薄雾浓云愁永昼",
        "author": "宋·李清照",
        "content": "薄雾浓云愁永昼，\n瑞脑消金兽。\n佳节又重阳，\n玉枕纱厨，\n半夜凉初透。\n\n东篱把酒黄昏后，\n有暗香盈袖。\n莫道不消魂。\n帘卷西风，\n人比黄花瘦。"
    },
]
