var weekPoetry = [
    {
        "title": "清平乐·别来春半",
        "author": "李煜",
        "content": "别来春半,\n触目柔肠断。\n砌下落梅如雪乱，\n拂了一身还满。\n雁来音信无凭，\n路遥归梦难成。\n离恨恰如春草，\n更行更远还生。"
    },
    {
        "title": "问刘十九",
        "author": "白居易",
        "content": "绿蚁新醅酒，\n红泥小火炉。\n晚来天欲雪，\n能饮一杯无？"
    },
    {
        "title": "江城子·十年生死两茫茫",
        "author": "苏轼",
        "content": "十年生死两茫茫，\n不思量，自难忘。\n千里孤坟，无处话凄凉。\n纵使相逢应不识，\n尘满面，鬓如霜。\n夜来幽梦忽还乡，\n小轩窗，正梳妆。\n相顾无言，惟有泪千行。\n料得年年肠断处，\n明月夜，短松冈。"
    },
    {
        "title": "逢雪宿芙蓉山主人",
        "author": "刘长卿",
        "content": "日暮苍山远，\n天寒白屋贫。\n柴门闻犬吠，\n风雪夜归人。"
    },
    {
        "title": "别董大",
        "author": "高适",
        "content": "千里黄云白日曛，\n北风吹雁雪纷纷。\n莫愁前路无知己，\n天下谁人不识君。"
    },
    {
        "title": "元日",
        "author": "王安石",
        "content": "爆竹声中一岁除，\n春风送暖入屠苏。\n千门万户瞳瞳日，\n总把新桃换旧符。"
    },
    {
        "title": "除夜",
        "author": "白居易",
        "content": "薄晚支颐坐，\n中宵枕臂眠。\n一从身去国，\n再见日周天。\n老度江南岁，\n春抛渭北田。\n浔阳来早晚，\n明日是三年。"
    }
]