var weekPoetry = [
    {
        "title": "清平乐·别来春半",
        "author": "李煜",
        "content": "别来春半,\n触目柔肠断。\n砌下落梅如雪乱，\n拂了一身还满。\n雁来音信无凭，\n路遥归梦难成。\n离恨恰如春草，\n更行更远还生。"
    },
    {
        "title": "问刘十九",
        "author": "白居易",
        "content": "绿蚁新醅酒，\n红泥小火炉。\n晚来天欲雪，\n能饮一杯无？"
    },
    {
        "title": "江城子·十年生死两茫茫",
        "author": "苏轼",
        "content": "十年生死两茫茫，\n不思量，自难忘。\n千里孤坟，无处话凄凉。\n纵使相逢应不识，\n尘满面，鬓如霜。\n夜来幽梦忽还乡，\n小轩窗，正梳妆。\n相顾无言，惟有泪千行。\n料得年年肠断处，\n明月夜，短松冈。"
    },
    {
        "title": "逢雪宿芙蓉山主人",
        "author": "刘长卿",
        "content": "日暮苍山远，\n天寒白屋贫。\n柴门闻犬吠，\n风雪夜归人。"
    },
    {
        "title": "临江仙·金锁重门荒苑静",
        "author": "鹿虔扆",
        "content": "金锁重门荒苑静，\n绮窗愁对秋空。\n翠华一去寂无踪。\n玉楼歌吹，\n声断已随风。\n烟月不知人事改，\n夜阑还照深宫。\n藕花相向野塘中，\n暗伤亡国，\n清露泣香红。"
    },
    {
        "title": "元日",
        "author": "王安石",
        "content": "爆竹声中一岁除，\n春风送暖入屠苏。\n千门万户瞳瞳日，\n总把新桃换旧符。"
    },
    {
        "title": "除夜",
        "author": "白居易",
        "content": "薄晚支颐坐，\n中宵枕臂眠。\n一从身去国，\n再见日周天。\n老度江南岁，\n春抛渭北田。\n浔阳来早晚，\n明日是三年。"
    },
    {
        "title": "菩萨蛮·风柔日薄春犹早",
        "author": "李清照",
        "content": "风柔日薄春犹早，\n夹衫乍着心情好。\n睡起觉微寒，\n梅花鬓上残。\n故乡何处是，\n忘了除非醉。\n沉水卧时烧，\n香消酒未消。"
    },
    {
        "title": "青玉案·元夕",
        "author": "辛弃疾",
        "content": "东风夜放花千树，\n更吹落，星如雨。\n宝马雕车香满路，\n凤萧声动，玉壶光转，\n一夜鱼龙舞。\n蛾儿雪柳黄金缕，\n笑语盈盈暗香去。\n众里寻他千百度，\n蓦然回首，那人却在，\n灯火阑珊处。"
    },
    {
        "title": "浪淘沙令·帘外雨潺潺",
        "author": "李煜",
        "content": "帘外雨潺潺，\n春意阑珊，\n罗衾不耐五更寒。\n梦里不知身是客，\n一饷贪欢。\n独自莫凭阑，\n无限江山，\n别时容易见时难。\n流水落花春去也，\n天上人间。"
    },
    {
        "title": "钗头凤·红酥手",
        "author": "陆游",
        "content": "红酥手，黄縢酒，\n满城春色宫墙柳。\n东风恶，欢情薄。\n一怀愁绪，几年离索。\n错、错、错。\n春如旧，人空瘦，\n泪痕红浥鲛绡透。\n桃花落，闲池阁。\n山盟虽在，锦书难托。\n莫、莫、莫！"
    },
    {
        "title": "破阵子·燕子来时新社",
        "author": "晏殊",
        "content": "燕子来时新社，\n梨花落后清明。\n池上碧苔三四点，\n叶底黄鹂一两声，\n日长飞絮轻。\n巧笑东邻女伴，\n采桑径里逢迎。\n疑怪昨宵春梦好，\n元是今朝斗草赢，\n笑从双脸生。"
    },
    {
        "title": "虞美人·听雨",
        "author": "蒋捷",
        "content": "少年听雨歌楼上。\n红烛昏罗帐。\n壮年听雨客舟中。\n江阔云低、断雁叫西风。\n而今听雨僧庐下。\n鬓已星星也。\n悲欢离合总无情。\n一任阶前、点滴到天明。"
    },
    {
        "title": "清明",
        "author": "杜牧",
        "content": "清明时节雨纷纷，\n路上行人欲断魂。\n借问酒家何处有，\n牧童遥指杏花村。"
    },
    {
        "title": "蝶恋花·春景",
        "author": "苏轼",
        "content": "花褪残红青杏小。\n燕子飞时，\n绿水人家绕。\n枝上柳绵吹又少，\n天涯何处无芳草！\n墙里秋千墙外道。\n墙外行人，\n墙里佳人笑。\n笑渐不闻声渐悄，\n多情却被无情恼。"
    },
    {
        "title": "阳春曲·春景",
        "author": "胡祗遹",
        "content": "几枝红雪墙头杏，\n数点青山屋上屏。\n一春能得几晴明？\n三月景，宜醉不宜醒。\n残花酝酿蜂儿蜜，\n细雨调和燕子泥。\n绿窗春睡觉来迟。\n谁唤起？窗外晓莺啼。\n一帘红雨桃花谢，\n十里清阴柳影斜。\n洛阳花酒一时别。\n春去也，闲煞旧蜂蝶。"
    },
    {
        "title": "婆罗门引·春尽夜",
        "author": "夏完淳",
        "content": "晚鸦飞去，一枝花影送黄昏。\n春归不阻重门。\n辞却江南三月，\n何处梦堪温？\n更阶前新绿，空锁芳尘。\n随风摇曳云，\n不须兰棹朱轮。\n只有梧桐枝上，留得三分。\n多情皓魄，怕明宵、还照旧钗痕。\n登楼望、柳外销魂"
    },
    {
        "title": "望江南·三月暮",
        "author": "吴文英",
        "content": "三月暮，\n花落更情浓。\n人去秋千闲挂月，\n马停杨柳倦嘶风。\n堤畔画船空。\n恹恹醉，\n长日小帘栊。\n宿燕夜归银烛外，\n啼莺声在绿阴中。\n无处觅残红。"
    },
    {
        "title": "蝶恋花",
        "author": "欧阳修",
        "content": "庭院深深深几许，\n杨柳堆烟，帘幕无重数。\n玉勒雕鞍游冶处，\n楼高不见章台路。 \n雨横风狂三月暮，\n门掩黄昏，无计留春住。\n泪眼问花花不语，\n乱红飞过秋千去。"
    },
    {
        "title": "大林寺桃花",
        "author": "白居易",
        "content": "人间四月芳菲尽，\n山寺桃花始盛开。\n长恨春归无觅处，\n不知转入此中来。"
    },
    {
        "title": "客中初夏",
        "author": "司马光",
        "content": "四月清和雨乍晴，\n南山当户转分明。\n更无柳絮因风起，\n惟有葵花向日倾。"
    },
    {
        "title": "阮郎归•初夏 ",
        "author": "苏轼",
        "content": "绿槐高柳咽新蝉，\n薰风初入弦。\n碧纱窗下水沉烟，\n棋声惊昼眠。\n微雨过，\n小荷翻，\n榴花开欲燃。\n玉盆纤手弄清泉，\n琼珠碎却圆。"
    },
    
]
