var weekPoetry = [
    {
        "title": "清平乐·别来春半",
        "author": "李煜",
        "content": "别来春半,\n触目柔肠断。\n砌下落梅如雪乱，\n拂了一身还满。\n雁来音信无凭，\n路遥归梦难成。\n离恨恰如春草，\n更行更远还生。"
    },
    {
        "title": "问刘十九",
        "author": "白居易",
        "content": "绿蚁新醅酒，\n红泥小火炉。\n晚来天欲雪，\n能饮一杯无？"
    },
    {
        "title": "江城子·十年生死两茫茫",
        "author": "苏轼",
        "content": "十年生死两茫茫，\n不思量，自难忘。\n千里孤坟，无处话凄凉。\n纵使相逢应不识，\n尘满面，鬓如霜。\n夜来幽梦忽还乡，\n小轩窗，正梳妆。\n相顾无言，惟有泪千行。\n料得年年肠断处，\n明月夜，短松冈。"
    },
    {
        "title": "逢雪宿芙蓉山主人",
        "author": "刘长卿",
        "content": "日暮苍山远，\n天寒白屋贫。\n柴门闻犬吠，\n风雪夜归人。"
    },
    {
        "title": "临江仙·金锁重门荒苑静",
        "author": "鹿虔扆",
        "content": "金锁重门荒苑静，\n绮窗愁对秋空。\n翠华一去寂无踪。\n玉楼歌吹，\n声断已随风。\n烟月不知人事改，\n夜阑还照深宫。\n藕花相向野塘中，\n暗伤亡国，\n清露泣香红。"
    },
    {
        "title": "元日",
        "author": "王安石",
        "content": "爆竹声中一岁除，\n春风送暖入屠苏。\n千门万户瞳瞳日，\n总把新桃换旧符。"
    },
    {
        "title": "除夜",
        "author": "白居易",
        "content": "薄晚支颐坐，\n中宵枕臂眠。\n一从身去国，\n再见日周天。\n老度江南岁，\n春抛渭北田。\n浔阳来早晚，\n明日是三年。"
    },
    {
        "title": "菩萨蛮·风柔日薄春犹早",
        "author": "李清照",
        "content": "风柔日薄春犹早，\n夹衫乍着心情好。\n睡起觉微寒，\n梅花鬓上残。\n故乡何处是，\n忘了除非醉。\n沉水卧时烧，\n香消酒未消。"
    },
    {
        "title": "青玉案·元夕",
        "author": "辛弃疾",
        "content": "东风夜放花千树，\n更吹落，星如雨。\n宝马雕车香满路，\n凤萧声动，玉壶光转，\n一夜鱼龙舞。\n蛾儿雪柳黄金缕，\n笑语盈盈暗香去。\n众里寻他千百度，\n蓦然回首，那人却在，\n灯火阑珊处。"
    },
    {
        "title": "秦楼月·浮云集",
        "author": "范成大",
        "content": "浮云集，\n轻雷隐隐初惊蛰。\n初惊蛰，\n鹁鸠鸣怒，\n绿杨风急。\n玉炉烟重香罗浥，\n拂墙浓杏燕支湿。\n燕支湿，\n花梢缺处，\n画楼人立。"
    },
]
