var weekPoetry = [
    {
        "title": "采桑子·恨君不似江楼月",
        "author": "宋·吕本中",
        "image": "polayoutu-yue-00005",
        "content": "恨君不似江楼月，\n南北东西，\n南北东西，\n只有相随无别离。\n恨君却似江楼月，\n暂满还亏，\n暂满还亏，\n待得团圆是几时？"
    },
    {
        "title": "问刘十九",
        "author": "唐·白居易",
        "image": "polayoutu-00006",
        "content": "绿蚁新醅酒，\n红泥小火炉。\n晚来天欲雪，\n能饮一杯无？"
    },
    {
        "title": "江城子·十年生死两茫茫",
        "author": "宋·苏轼",
        "image": "polayoutu-00021",
        "content": "十年生死两茫茫，\n不思量，自难忘。\n千里孤坟，无处话凄凉。\n纵使相逢应不识，\n尘满面，鬓如霜。\n夜来幽梦忽还乡，\n小轩窗，正梳妆。\n相顾无言，惟有泪千行。\n料得年年肠断处，\n明月夜，短松冈。"
    },
    {
        "title": "逢雪宿芙蓉山主人",
        "author": "唐·刘长卿",
        "image": "polayoutu-00040",
        "content": "日暮苍山远，\n天寒白屋贫。\n柴门闻犬吠，\n风雪夜归人。"
    },
    {
        "title": "次北固山下",
        "author": "唐·王湾",
        "image": "polayoutu-00078",
        "content": "客路青山外， 行舟绿水前。\n潮平两岸阔， 风正一帆悬。\n海日生残夜， 江春入旧年。\n乡书何处达？ 归雁洛阳边。"
    },
    {
        "title": "元日",
        "author": "宋·王安石",
        "image": "new-year",
        "content": "爆竹声中一岁除，\n春风送暖入屠苏。\n千门万户瞳瞳日，\n总把新桃换旧符。"
    },
    {
        "title": "菩萨蛮·风柔日薄春犹早",
        "author": "宋·李清照",
        "image": "polayoutu-00024",
        "content": "风柔日薄春犹早，\n夹衫乍着心情好。\n睡起觉微寒，\n梅花鬓上残。\n故乡何处是，\n忘了除非醉。\n沉水卧时烧，\n香消酒未消。"
    },
    {
        "title": "青玉案·元夕",
        "author": "宋·辛弃疾",
        "image": "polayoutu-00017",
        "content": "东风夜放花千树，\n更吹落，星如雨。\n宝马雕车香满路，\n凤萧声动，玉壶光转，\n一夜鱼龙舞。\n蛾儿雪柳黄金缕，\n笑语盈盈暗香去。\n众里寻他千百度，\n蓦然回首，那人却在，\n灯火阑珊处。"
    },
    {
        "title": "浪淘沙令·帘外雨潺潺",
        "author": "南唐·李煜",
        "image": "polayoutu-1127-00006",
        "content": "帘外雨潺潺，\n春意阑珊，\n罗衾不耐五更寒。\n梦里不知身是客，\n一饷贪欢。\n独自莫凭阑，\n无限江山，\n别时容易见时难。\n流水落花春去也，\n天上人间。"
    },
    {
        "title": "钗头凤·红酥手",
        "author": "宋·陆游",
        "image": "polayoutu-00070",
        "content": "红酥手，黄縢酒，\n满城春色宫墙柳。\n东风恶，欢情薄。\n一怀愁绪，几年离索。\n错、错、错。\n春如旧，人空瘦，\n泪痕红浥鲛绡透。\n桃花落，闲池阁。\n山盟虽在，锦书难托。\n莫、莫、莫！"
    },
    {
        "title": "破阵子·燕子来时新社",
        "author": "宋·晏殊",
        "image": "polayoutu-00071",
        "content": "燕子来时新社，\n梨花落后清明。\n池上碧苔三四点，\n叶底黄鹂一两声，\n日长飞絮轻。\n巧笑东邻女伴，\n采桑径里逢迎。\n疑怪昨宵春梦好，\n元是今朝斗草赢，\n笑从双脸生。"
    },
    {
        "title": "虞美人·听雨",
        "author": "宋·蒋捷",
        "image": "renrenxiaozhan-00026",
        "content": "少年听雨歌楼上。\n红烛昏罗帐。\n壮年听雨客舟中。\n江阔云低、断雁叫西风。\n而今听雨僧庐下。\n鬓已星星也。\n悲欢离合总无情。\n一任阶前、点滴到天明。"
    },
    {
        "title": "渔家傲·平岸小桥千嶂抱",
        "author": "宋·王安石",
        "image": "polayoutu-00037",
        "content": "平岸小桥千嶂抱，柔蓝一水萦花草。\n茅屋数间窗窈窕。\n尘不到，时时自有春风扫。\n午枕觉来闻语鸟，欹眠似听朝鸡早。\n忽忆故人今总老。\n贪梦好，茫然忘了邯郸道。"
    },
    {
        "title": "清明",
        "author": "唐·杜牧",
        "image": "polayoutu-00065",
        "content": "清明时节雨纷纷，\n路上行人欲断魂。\n借问酒家何处有，\n牧童遥指杏花村。"
    },
    {
        "title": "蝶恋花·春景",
        "author": "宋·苏轼",
        "image": "polayoutu-00068",
        "content": "花褪残红青杏小。\n燕子飞时，\n绿水人家绕。\n枝上柳绵吹又少，\n天涯何处无芳草！\n墙里秋千墙外道。\n墙外行人，\n墙里佳人笑。\n笑渐不闻声渐悄，\n多情却被无情恼。"
    },
    {
        "title": "江畔独步寻花·六七",
        "author": "唐·杜甫",
        "image": "polayoutu-00019",
        "content": "黄四娘家花满蹊，千朵万朵压枝低。\n留连戏蝶时时舞，自在娇莺恰恰啼。\n不是爱花即肯死，只恐花尽老相催。\n繁枝容易纷纷落，嫩蕊商量细细开。"
    },
    {
        "title": "婆罗门引·春尽夜",
        "author": "明·夏完淳",
        "image": "polayoutu-00034",
        "content": "晚鸦飞去，一枝花影送黄昏。\n春归不阻重门。\n辞却江南三月，何处梦堪温？\n更阶前新绿，空锁芳尘。\n随风摇曳云，不须兰棹朱轮。\n只有梧桐枝上，留得三分。\n多情皓魄，怕明宵、还照旧钗痕。\n登楼望、柳外销魂。"
    },
    {
        "title": "望江南·三月暮",
        "author": "宋·吴文英",
        "image": "polayoutu-00066",
        "content": "三月暮，花落更情浓。\n人去秋千闲挂月，\n马停杨柳倦嘶风。\n堤畔画船空。\n恹恹醉，长日小帘栊。\n宿燕夜归银烛外，\n啼莺声在绿阴中。\n无处觅残红。"
    },
    {
        "title": "蝶恋花",
        "author": "宋·欧阳修",
        "image": "renrenxiaozhan-00018",
        "content": "庭院深深深几许，\n杨柳堆烟，帘幕无重数。\n玉勒雕鞍游冶处，\n楼高不见章台路。 \n雨横风狂三月暮，\n门掩黄昏，无计留春住。\n泪眼问花花不语，\n乱红飞过秋千去。"
    },
    {
        "title": "大林寺桃花",
        "author": "唐·白居易",
        "image": "polayoutu-00072",
        "content": "人间四月芳菲尽，\n山寺桃花始盛开。\n长恨春归无觅处，\n不知转入此中来。"
    },
    {
        "title": "定风波·莫听穿林打叶声",
        "author": "宋·苏轼",
        "image": "polayoutu-00050",
        "content": "莫听穿林打叶声，\n何妨吟啸且徐行。\n竹杖芒鞋轻胜马，\n谁怕？一蓑烟雨任平生。\n料峭春风吹酒醒，\n微冷，山头斜照却相迎。\n回首向来萧瑟处，\n归去，也无风雨也无晴。"
    },
    {
        "title": "阮郎归•初夏 ",
        "author": "宋·苏轼",
        "image": "polayoutu-00025",
        "content": "绿槐高柳咽新蝉，\n薰风初入弦。\n碧纱窗下水沉烟，\n棋声惊昼眠。\n微雨过，\n小荷翻，\n榴花开欲燃。\n玉盆纤手弄清泉，\n琼珠碎却圆。"
    },
    {
        "title": "南乡子•端午",
        "author": "宋·李之仪",
        "image": "polayoutu-00028",
        "content": "小雨湿黄昏。\n重午佳辰独掩门。\n巢燕引雏浑去尽，销魂。\n空向梁间觅宿痕。\n客舍宛如村。\n好事无人载一樽。\n唯有莺声知此恨，殷勤。\n恰似当时枕上闻。"
    },
    {
        "title": "约客",
        "author": "宋·赵师秀",
        "image": "polayoutu-00033",
        "content": "黄梅时节家家雨，\n青草池塘处处蛙。\n有约不来过夜半，\n闲敲棋子落灯花。"
    },
    {
        "title": "青玉案•横塘路",
        "author": "宋·贺铸",
        "image": "polayoutu-00042",
        "content": "凌波不过横塘路，\n但目送，芳尘去。\n锦瑟华年谁与度？\n月桥花院，琐窗朱户，只有春知处。\n碧云冉冉蘅皋暮，\n彩笔新题断肠句。\n试问闲愁都几许？\n一川烟草，满城风絮，梅子黄时雨。"
    },
    {
        "title": "喜晴",
        "author": "宋·范成大",
        "image": "polayoutu-00030",
        "content": "窗间梅熟落蒂，\n墙下笋成出林。\n连雨不知春去，\n一晴方觉夏深。"
    },
    {
        "title": "西江月·夜行黄沙道中",
        "author": "宋·辛弃疾",
        "image": "polayoutu-yue-00007",
        "content": "明月别枝惊鹊，\n清风半夜鸣蝉。\n稻花香里说丰年，\n听取蛙声一片。 \n七八个星天外，\n两三点雨山前。\n旧时茅店社林边，\n路转溪桥忽见。"
    },
    {
        "title": "声声慢·寻寻觅觅",
        "author": "宋·李清照",
        "image": "polayoutu-00073",
        "content": "寻寻觅觅，冷冷清清，凄凄惨惨戚戚。\n乍暖还寒时候，最难将息。\n三杯两盏淡酒，怎敌他、晚来风急？\n雁过也，正伤心，却是旧时相识。\n满地黄花堆积。憔悴损，如今有谁堪摘？\n守着窗儿，独自怎生得黑？\n梧桐更兼细雨，到黄昏、点点滴滴。\n这次第，怎一个愁字了得！"
    },
    {
        "title": "更漏子·玉炉香",
        "author": "唐·温庭筠",
        "image": "renrenxiaozhan-00011",
        "content": "玉炉香，红蜡泪，\n偏照画堂秋思。\n眉翠薄，鬓云残，\n夜长衾枕寒。\n梧桐树，三更雨，\n不道离情正苦。\n一叶叶，一声声，\n空阶滴到明。"
    },
    {
        "title": "苔",
        "author": "清·袁枚",
        "image": "polayoutu-00074",
        "content": "白日不到处，青春恰自来。\n苔花如米小，亦学牡丹开。"
    },
    {
        "title": "如梦令·常记溪亭日暮",
        "author": "宋·李清照",
        "image": "polayoutu-00075",
        "content": "常记溪亭日暮，\n沉醉不知归路，\n兴尽晚回舟，\n误入藕花深处。\n争渡，争渡，\n惊起一滩鸥鹭。"
    },
    {
        "title": "浣溪沙·一曲新词酒一杯",
        "author": "宋·晏殊",
        "image": "jackeygao-ku-0001",
        "content": "一曲新词酒一杯，\n去年天气旧亭台，\n夕阳西下几时回。\n无可奈何花落去，\n似曾相识燕归来。\n小园香径独徘徊。"
    },
    {
        "title": "虞美人·春花秋月何时了",
        "author": "南唐·李煜",
        "image": "polayoutu-00052",
        "content": "春花秋月何时了？\n往事知多少。\n小楼昨夜又东风，\n故国不堪回首月明中。\n雕栏玉砌应犹在，\n只是朱颜改。\n问君能有几多愁？\n恰似一江春水向东流。"
    },
    {
        "title": "如梦令·谁伴明窗独坐",
        "author": "宋·李清照",
        "image": "polayoutu-00060",
        "content": "谁伴明窗独坐，\n我共影儿俩个。\n灯尽欲眠时，影也把人抛躲。\n无那，无那，\n好个凄凉的我。"
    },
    {
        "title": "清平乐·村居",
        "author": "宋·辛弃疾",
        "image": "polayoutu-00076",
        "content": "茅檐低小，\n溪上青青草。\n醉里吴音相媚好，\n白发谁家翁媪?\n大儿锄豆溪东，\n中儿正织鸡笼。\n最喜小儿亡赖，\n溪头卧剥莲蓬。"
    },
    {
        "title": "秋夕",
        "author": "唐·杜牧",
        "image": "polayoutu-yue-00008",
        "content": "红烛秋光冷画屏，\n轻罗小扇扑流萤。\n天阶夜色凉如水，\n坐看牵牛织女星。"
    },
    {
        "title": "水调歌头",
        "author": "宋·苏轼",
        "image": "polayoutu-yue-00001",
        "content": "明月几时有？把酒问青天。\n不知天上宫阙，今夕是何年？\n我欲乘风归去，又恐琼楼玉宇，高处不胜寒！\n起舞弄清影，何似在人间？ \n转朱阁，低绮户，照无眠。\n不应有恨，何事长向别时圆？\n人有悲欢离合，月有阴晴圆缺，此事古难全。\n但愿人长久，千里共婵娟。"
    },
    {
        "title": "赠刘景文",
        "author": "宋·苏轼",
        "image": "jackeygao-ku-0004",
        "content": "荷尽已无擎雨盖，\n菊残犹有傲霜枝。\n一年好景君须记，\n最是橙黄橘绿时。"
    },
    {
        "title": "秋词",
        "author": "唐·刘禹锡",
        "image": "polayoutu-00035",
        "content": "自古逢秋悲寂寥，\n我言秋日胜春朝。\n晴空一鹤排云上，\n便引诗情到碧霄。"
    },
    {
        "title": "宣州谢朓楼饯别校书叔云",
        "author": "唐·李白",
        "image": "polayoutu-1127-00002",
        "content": "弃我去者，昨日之日不可留。\n乱我心者，今日之日多烦忧。\n长风万里送秋雁，对此可以酣高楼。\n蓬莱文章建安骨，中间小谢又清发。\n俱怀逸兴壮思飞，欲上青天览明月。\n抽刀断水水更流，举杯消愁愁更愁。\n人生在世不称意，明朝散发弄扁舟。"
    },
    {
        "title": "九月九日忆山东兄弟",
        "author": "唐·王维",
        "image": "polayoutu-1127-00009",
        "content": "独在异乡为异客，\n每逢佳节倍思亲。\n遥知兄弟登高处，\n遍插茱萸少一人。"
    },
    {
        "title": "九日齐山登高",
        "author": "唐·杜牧",
        "image": "polayoutu-yue-00002",
        "content": "江涵秋影雁初飞，与客携壶上翠微。\n尘世难逢开口笑，菊花须插满头归。\n但将酩酊酬佳节，不用登临恨落晖。\n古往今来只如此，牛山何必独沾衣？"
    },
    {
        "title": "醉花阴·薄雾浓云愁永昼",
        "author": "宋·李清照",
        "image": "renrenxiaozhan-00004",
        "content": "薄雾浓云愁永昼，\n瑞脑消金兽。\n佳节又重阳，\n玉枕纱厨，\n半夜凉初透。\n\n东篱把酒黄昏后，\n有暗香盈袖。\n莫道不消魂。\n帘卷西风，\n人比黄花瘦。"
    },
    {
        "title": "苏幕遮·怀旧",
        "author": "宋·范仲淹",
        "image": "polayoutu-00077",
        "content": "碧云天，黄叶地，\n秋色连波，波上寒烟翠。\n山映斜阳天接水。\n芳草无情，更在斜阳外。\n黯乡魂，追旅思，\n夜夜除非，好梦留人睡。\n明月楼高休独倚。\n酒入愁肠，化作相思泪。"
    },
    {
        "title": "相见欢·无言独上西楼",
        "author": "南唐·李煜",
        "image": "polayoutu-yue-00010",
        "content": "无言独上西楼，月如钩，\n寂寞梧桐深院锁清秋。\n剪不断，理还乱，\n是离愁，别是一般滋味在心头。"
    },
    {
        "title": "夜雨寄北",
        "author": "唐·李商隐",
        "image": "renrenxiaozhan-00002",
        "content": "君问归期未有期，巴山夜雨涨秋池。\n何当共剪西窗烛，却话巴山夜雨时。"
    },
    {
        "title": "卜算子·黄州定慧院寓居作",
        "author": "宋·苏轼",
        "image": "polayoutu-00001",
        "content": "缺月挂疏桐，漏断人初静。\n时见幽人独往来，缥缈孤鸿影。\n惊起却回头，有恨无人省。\n拣尽寒枝不肯栖，寂寞沙洲冷。"
    },
    {
        "title": "长相思·惜梅",
        "author": "宋·刘克庄",
        "image": "jackeygao-taishan-00001",
        "content": "寒相催。暖相催。\n催了开时催谢时。\n丁宁花放迟。\n角声吹。笛声吹。\n吹了南枝吹北枝。\n明朝成雪飞。"
    },
    {
        "title": "别董大二首",
        "author": "唐·高适",
        "image": "polayoutu-00047",
        "content": "千里黄云白日曛，北风吹雁雪纷纷。\n莫愁前路无知己，天下谁人不识君。\n六翮飘飖私自怜，一离京洛十余年。\n丈夫贫贱应未足，今日相逢无酒钱。"
    },
    {
        "title": "长相思·山一程",
        "author": "清·纳兰性德",
        "image": "polayoutu-00069",
        "content": "山一程，水一程，\n身向榆关那畔行，\n夜深千帐灯。\n风一更，雪一更，\n聒碎乡心梦不成，\n故园无此声。"
    },
    {
        "title": "凉州词·其一",
        "author": "唐·王之涣",
        "image": "polayoutu-00054",
        "content": "黄河远上白云间，一片孤城万仞山。\n羌笛何须怨杨柳，春风不度玉门关。"
    },
    {
        "title": "定风波·南海归赠王定国侍人寓娘",
        "author": "宋·苏轼",
        "image": "renrenxiaozhan-00024",
        "content": "常羡人间琢玉郎，\n天应乞与点酥娘。\n尽道清歌传皓齿，\n风起，雪飞炎海变清凉。\n万里归来颜愈少，\n微笑，笑时犹带岭梅香。\n试问岭南应不好，\n却道：此心安处是吾乡。"
    },
]
